howlanjo/Lab-2_ST7735_MSP432/ST7735.c
// *************** ST7735_SetPrintOptions ********************
// Sets up screen printing parameters so that
// user does not have to keep setting these parameters.
// Inputs: 	X -- x position on screen
//			Y -- y position on screen
//			CharColor -- character color
//			BgColor -- Background color
//			Size -- Size of font
// Outputs: err -- Indication on whether an error was propagated
int ST7735_SetPrintOptions(int16_t xPos, int16_t yPos, int16_t colorChar, int16_t colorBackground, int8_t size)
{
	int16_t testingColor = 0;
	int i = 0, err = 0;

	//Make sure valid size was passed in
	if(size < 1 || size > 10)
		err = -1;
	else
	{
		//Sets X location to zero if off screen
		if((xPos >= _width) || ((xPos + 5 * size - 1) < 0))
			StX = 0;
		else
			StX = xPos;

		//Sets Y location back to zero if off screen
		if((yPos >= _height) || ((yPos + 8 * size - 1) < 0))
			StY = 0;
		else
			StY = yPos;

		//Loops through both the text and background and set global variables
		for(i = 0; i < 2; i ++)
		{
			if(i == 0)	// Zero is the text color
				testingColor = colorChar;
			else		// One is the background color
				testingColor = colorBackground;

			switch(testingColor)
			{
				case ST7735_BLACK:
					testingColor = ST7735_BLACK;
				break;
				case ST7735_BLUE:
					testingColor = ST7735_BLUE;
				break;
				case ST7735_RED:
					testingColor = ST7735_RED;
				break;
				case ST7735_GREEN:
					testingColor = ST7735_GREEN;
				break;
				case ST7735_CYAN:
					testingColor = ST7735_CYAN;
				break;
				case ST7735_MAGENTA:
					testingColor = ST7735_MAGENTA;
				break;
				case ST7735_YELLOW:
					testingColor = ST7735_YELLOW;
				break;
				case ST7735_WHITE:
					testingColor = ST7735_WHITE;
				break;
				default:
					if(i == 0) 	//Text color default to black
						testingColor = ST7735_BLACK;
					else		//Background color default to White
						testingColor = ST7735_WHITE;
				break;
			}

			if(i == 0)
				TextColor = testingColor;
			else
				BgColor = testingColor;
		}
	}

	return err;
}

//------------ST7735_DrawCharS------------
// Simple character draw function.  This is the same function from
// Adafruit_GFX.c but adapted for this processor.  However, each call
// to ST7735_DrawPixel() calls setAddrWindow(), which needs to send
// many extra data and commands.  If the background color is the same
// as the text color, no background will be printed, and text can be
// drawn right over existing images without covering them with a box.
// Requires (11 + 2*size*size)*6*8 bytes of transmission (image fully on screen; textcolor != bgColor)
// Input: x         horizontal position of the top left corner of the character, columns from the left edge
//        y         vertical position of the top left corner of the character, rows from the top edge
//        c         character to be printed
//        textColor 16-bit color of the character
//        bgColor   16-bit color of the background
//        size      number of pixels per character pixel (e.g. size==2 prints each pixel of font as 2x2 square)
// Output: none
void ST7735_DrawCharS(int16_t x, int16_t y, char c, int16_t textColor, int16_t bgColor, uint8_t size){
  uint8_t line; // vertical column of pixels of character in font
  int32_t i, j;
  if((x >= _width)            || // Clip right
     (y >= _height)           || // Clip bottom
     ((x + 5 * size - 1) < 0) || // Clip left
     ((y + 8 * size - 1) < 0))   // Clip top
    return;

  for (i=0; i<6; i++ ) {
    if (i == 5)
      line = 0x0;
    else
      line = Font[(c*5)+i];
    for (j = 0; j<8; j++) {
      if (line & 0x1) {
        if (size == 1) // default size
          ST7735_DrawPixel(x+i, y+j, textColor);
        else {  // big size
          ST7735_FillRect(x+(i*size), y+(j*size), size, size, textColor);
        }
      } else if (bgColor != textColor) {
        if (size == 1) // default size
          ST7735_DrawPixel(x+i, y+j, bgColor);
        else {  // big size
          ST7735_FillRect(x+i*size, y+j*size, size, size, bgColor);
        }
      }
      line >>= 1;
    }
  }
}


//------------ST7735_DrawChar------------
// Advanced character draw function.  This is similar to the function
// from Adafruit_GFX.c but adapted for this processor.  However, this
// function only uses one call to setAddrWindow(), which allows it to
// run at least twice as fast.
// Requires (11 + size*size*6*8) bytes of transmission (assuming image fully on screen)
// Input: x         horizontal position of the top left corner of the character, columns from the left edge
//        y         vertical position of the top left corner of the character, rows from the top edge
//        c         character to be printed
//        textColor 16-bit color of the character
//        bgColor   16-bit color of the background
//        size      number of pixels per character pixel (e.g. size==2 prints each pixel of font as 2x2 square)
// Output: none
void ST7735_DrawChar(int16_t x, int16_t y, char c, int16_t textColor, int16_t bgColor, uint8_t size){
  uint8_t line; // horizontal row of pixels of character
  int32_t col, row, i, j;// loop indices
  if(((x + 5*size - 1) >= _width)  || // Clip right
     ((y + 8*size - 1) >= _height) || // Clip bottom
     ((x + 5*size - 1) < 0)        || // Clip left
     ((y + 8*size - 1) < 0)){         // Clip top
    return;
  }

  setAddrWindow(x, y, x+6*size-1, y+8*size-1);

  line = 0x01;        // print the top row first
  // print the rows, starting at the top
  for(row=0; row<8; row=row+1){
    for(i=0; i<size; i=i+1){
      // print the columns, starting on the left
      for(col=0; col<5; col=col+1){
        if(Font[(c*5)+col]&line){
          // bit is set in Font, print pixel(s) in text color
          for(j=0; j<size; j=j+1){
            pushColor(textColor);
          }
        } else{
          // bit is cleared in Font, print pixel(s) in background color
          for(j=0; j<size; j=j+1){
            pushColor(bgColor);
          }
        }
      }
      // print blank column(s) to the right of character
      for(j=0; j<size; j=j+1){
        pushColor(bgColor);
      }
    }
    line = line<<1;   // move up to the next row
  }
}


//------------ST7735_DrawString------------
// String draw function.
// 16 rows (0 to 15) and 21 characters (0 to 20)
// Requires (11 + size*size*6*8) bytes of transmission for each character
// Input: x         columns from the left edge (0 to 20)
//        y         rows from the top edge (0 to 15)
//        pt        pointer to a null terminated string to be printed
//        textColor 16-bit color of the characters
// bgColor is Black and size is 1
// Output: number of characters printed
uint32_t ST7735_DrawString(uint16_t x, uint16_t y, char *pt, int16_t textColor){
  uint32_t count = 0;
  if(y>15) return 0;
  while(*pt){
    ST7735_DrawCharS(x*6, y*10, *pt, textColor, ST7735_BLACK, 1);
    pt++;
    x = x+1;
    if(x>20) return count;  // number of characters printed
    count++;
  }
  return count;  // number of characters printed
}


//-----------------------fillmessage-----------------------
// Output a 32-bit number in unsigned decimal format
// Input: 32-bit number to be transferred
// Output: none
// Variable format 1-10 digits with no space before or after
char Message[12];
uint32_t Messageindex;

